// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

int main()
{
        cout << "Enter your name:";
        char name [32] = { 0 };
        cin >> name;

        cout << "Enter your last name:";
        char surname[32] = { 0 };
        cin >> surname;

        cout << "Enter your nickname:";
        char nick[32] = { 0 };
        cin >> nick;

        cout << "Hello, " << name << " aKa " << nick << " " << surname; 

        return 0;
}

enum XO { X, O, E };

int task1()
{
    XO Pole[3] = { X, O, E };
    struct XO
    {
        X;

    };

}   

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
